import re
# !!!
# Дисклеймер: 18+, в тексте присутствует ненормативная лексика. Считать корни слов совпадением с плохими словами
# !!!






class Data:
	dictWords = [
		"блят",
		"бляд",
		"хуй",
		"хуе",
		"хуя",
		"хуи",
		"пизд",
		"пздц",
		"еба",
		"ебн",
		"ёбн",
		"ёбы",
		"ёб",
		"ебе",
		"еба",
		"еби",
		"fuck",
		"долбоеб",
		"сука",
		"суки",
		"пидор",
		"гомосек",
		"гондон",
		"хер",
		"хир"

	]
	dictLetters = {
		"а" : ['а','А', 'a', '@'],
		"б" : ['б','Б', '6', 'b'],
		"в" : ['в','В', 'b', 'v'],
		"г" : ['г','Г', 'r', 'g'],
		"д" : ['д','Д', 'd', 'g'],
		"е" : ['е','Е', 'e', "ё"],
		"ё" : ['ё','Ё', 'е', 'e'],
		"ж" : ['ж','Ж', 'zh', '*'],
		"з" : ['з','З', '3', 'z'],
		"и" : ['и','И', 'u', 'i'],
		"й" : ['й','Й', 'u', 'y', 'i'],
		"к" : ['к','К', 'k', 'i{', '|{'],
		"л" : ['л','Л', 'l', 'ji'],
		"м" : ['м','М', 'm'],
		"н" : ['н','Н', 'h', 'n'],
		"о" : ['о','О', 'o', '0'],
		"п" : ['п','П', 'n', 'p'],
		"р" : ['р','Р', 'r', 'p'],
		"с" : ['с','С', 'c', 's'],
		"т" : ['т','Т', 'm', 't'],
		"у" : ['у','У', 'y', 'u'],
		"ф" : ['ф','Ф', 'f'],
		"х" : ['х','Х', 'x', 'h', 'к', 'k', '}{'],
		"ц" : ['ц','Ц', 'c', 'u,'],
		"ч" : ['ч','Ч', 'ch'],
		"ш" : ['ш','Ш', 'sh'],
		"щ" : ['щ','Щ', 'sch'],
		"ь" : ['ь','Ь', 'b'],
		"ы" : ['ы','Ы', 'bi'],
		"ъ" : ['ъ' 'Ъ', ],
		"э" : ['э','Э', 'е', 'e'],
		"ю" : ['ю','Ю', 'io'],
		"я" : ['я','Я', 'ya'],
		"f" : ["f", "F"],
		"u" : ["u", "U"],
		"c" : ["c", "C", "с", "С"],
		"k" : ["k", "K", "к", "К"]
	}

	ARRRegExp = [
		r"(\?w+)?((?:б|Б|6|b)\W*[лЛlji]\W*[яЯya]\W*[тТmt]\W*?)(\w+)?",
		r"(\?w+)?((?:б|Б|6|b)\W*[лЛlji]\W*[яЯya]\W*[дДdg]\W*?)(\w+)?",
		r"(\?w+)?((?:х|Х|x|h|к|k|}{)\W*[уУyu]\W*[йЙuyi]\W*?)(\w+)?",
		r"(\?w+)?((?:х|Х|x|h|к|k|}{)\W*[уУyu]\W*[еЕeё]\W*?)(\w+)?",
		r"(\?w+)?((?:х|Х|x|h|к|k|}{)\W*[уУyu]\W*[яЯya]\W*?)(\w+)?",
		r"(\?w+)?((?:х|Х|x|h|к|k|}{)\W*[уУyu]\W*[иИui]\W*?)(\w+)?",
		r"(\?w+)?((?:п|П|n|p)\W*[иИui]\W*[зЗ3z]\W*[дДdg]\W*?)(\w+)?",
		r"(\?w+)?((?:п|П|n|p)\W*[зЗ3z]\W*[дДdg]\W*[цЦcu,]\W*?)(\w+)?",
		r"(\?w+)?((?:е|Е|e|ё)\W*[бБ6b]\W*[аАa@]\W*?)(\w+)?",
		r"(\?w+)?((?:е|Е|e|ё)\W*[бБ6b]\W*[нНhn]\W*?)(\w+)?",
		r"(\?w+)?((?:ё|Ё|е|e)\W*[бБ6b]\W*[нНhn]\W*?)(\w+)?",
		r"(\?w+)?((?:ё|Ё|е|e)\W*[бБ6b]\W*[ыЫbi]\W*?)(\w+)?",
		r"(\?w+)?((?:ё|Ё|е|e)\W*[бБ6b]\W*?)(\w+)?",
		r"(\?w+)?((?:е|Е|e|ё)\W*[бБ6b]\W*[еЕeё]\W*?)(\w+)?",
		r"(\?w+)?((?:е|Е|e|ё)\W*[бБ6b]\W*[аАa@]\W*?)(\w+)?",
		r"(\?w+)?((?:е|Е|e|ё)\W*[бБ6b]\W*[иИui]\W*?)(\w+)?",
		r"(\?w+)?((?:f|F)\W*[uU]\W*[cCсС]\W*[kKкК]\W*?)(\w+)?",
		r"(\?w+)?((?:д|Д|d|g)\W*[оОo0]\W*[лЛlji]\W*[бБ6b]\W*[оОo0]\W*[еЕeё]\W*[бБ6b]\W*?)(\w+)?",
		r"(\?w+)?((?:с|С|c|s)\W*[уУyu]\W*[кКki{|{]\W*[аАa@]\W*?)(\w+)?",
		r"(\?w+)?((?:с|С|c|s)\W*[уУyu]\W*[кКki{|{]\W*[иИui]\W*?)(\w+)?",
		r"(\?w+)?((?:п|П|n|p)\W*[иИui]\W*[дДdg]\W*[оОo0]\W*[рРrp]\W*?)(\w+)?",
		r"(\?w+)?((?:г|Г|r|g)\W*[оОo0]\W*[мМm]\W*[оОo0]\W*[сСcs]\W*[еЕeё]\W*[кКki{|{]\W*?)(\w+)?",
		r"(\?w+)?((?:г|Г|r|g)\W*[оОo0]\W*[нНhn]\W*[дДdg]\W*[оОo0]\W*[нНhn]\W*?)(\w+)?",
		r"(\?w+)?((?:х|Х|x|h|к|k|}{)\W*[еЕeё]\W*[рРrp]\W*?)(\w+)?",
		r"(\?w+)?((?:х|Х|x|h|к|k|}{)\W*[иИui]\W*[рРrp]\W*?)(\w+)?"
	]
data = Data()

# example: (\w+)?((?:п|x|h|к|k|}{)\W*[иyu]\W*[зuyi]\W*[дuyi]\W*)(\w+)?
def generateRegExps(_dictWords, _dictLetters):
	arrRegExp = []
	def unit(letter):
		# printed array behavior ""
		return r"["+ r"".join((_dictLetters[letter][i] for i in range(len(_dictLetters[letter])))) + r"]\W*"
	for i in _dictWords:
		arrRegExp.append(r"(\?w+)?((?:"+ r"|".join(_dictLetters[i[0]]) + r")\W*"+ r"".join((unit(i[j]) for j in range(1, len(i)))) +r"?)(\w+)?")
	return arrRegExp

def Filter(text, tamplate):
	_text = text
	for i in data.ARRRegExp:
		for j in re.findall(i, _text):
			_text = _text.replace("".join(j), tamplate)
	return _text

# for i in generateRegExps(data.dictWords, data.dictLetters):
# 	print(i)